app/controllers/api/projects_controller.rb

INSERT INTO "api_projects" ("title", "content", "author_id", "category_id", "blurb", "duration", "goal", "location", "saved_project_id", "author_full_name", "risks", "website", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18) RETURNING "id"
---
  def create
    debugger
    @project = Api::Project.new(project_params)
    if @project.save

SELECT  "api_projects".* FROM "api_projects" WHERE "api_projects"."id" = $1 LIMIT 1  [["id", 84]]
UPDATE "api_projects" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "api_projects"."id" = $4  [["image_updated_at", "2016-09-13 21:44:51.770899"], ["image_file_name", "d1lmKc9_-1.jpg"], ["updated_at", "2016-09-13 21:44:51.820051"], ["id", 84]]
---
  def update
    @project = Api::Project.find(params[:id])
    if @project.update(project_params)

SELECT  "api_projects".* FROM "api_projects" WHERE "api_projects"."id" = $1 LIMIT 1  [["id", 85]]
DELETE FROM "api_projects" WHERE "api_projects"."id" = $1  [["id", 85]]
---
  def destroy
    @project = Api::Project.find(params[:id])
    @project.destroy!

SELECT "api_projects".* FROM "api_projects"
---
  def index
    @projects = Api::Project.all()