app/controllers/api/rewards_controller.rb

  def create
    @reward = Api::Reward.new(reward_params)
    if @reward.save
---
INSERT INTO "api_rewards" ("title", "amount", "project_id", "project_reward_key", "quantity", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"