app/controllers/api/saved_projects_controller.rb

INSERT INTO "api_saved_projects" ("title", "author_id", "category_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdf"], ["author_id", 29], ["category_id", 0], ["created_at", "2016-09-13 15:37:41.745328"], ["updated_at", "2016-09-13 15:37:41.745328"]]
---
  def create
    @saved_project = Api::SavedProject.new(project_params)
    if @saved_project.save

SELECT  "api_saved_projects".* FROM "api_saved_projects" WHERE "api_saved_projects"."id" = $1 LIMIT 1  [["id", 164]]
UPDATE "api_saved_projects" SET "duration" = $1, "goal" = $2, "image_updated_at" = $3, "image_file_name" = $4, "updated_at" = $5 WHERE "api_saved_projects"."id" = $6  [["duration", 0], ["goal", 0], ["image_updated_at", "2016-09-13 20:21:21.948580"], ["image_file_name", "d1lmKc9_-1.jpg"], ["updated_at", "2016-09-13 20:21:21.997149"], ["id", 175]]
---
  def update
    @saved_project = Api::SavedProject.find(params[:id])
    if project_params[:image] === 'null' ||
      project_params[:image] === "/assets/default_pic.png"
      if @saved_project.update(no_image_params)

SELECT  "api_users".* FROM "api_users" WHERE "api_users"."id" = $1 LIMIT 1  [["id", 29]]
SELECT "api_saved_projects".* FROM "api_saved_projects" WHERE "api_saved_projects"."author_id" = $1  [["author_id", 29]]
---
  def index
    @user = Api::User.find(params[:user_id])
    @saved_projects = @user.saved_projects.includes(:author)