app/controllers/api/users_controller.rb

  def create
    @user = Api::User.new(user_params)
    if @user.save
---
INSERT INTO "api_users" ("username", "password_digest", "email", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @user = Api::User.find(params[:id])
    if @user.update(user_params)
---
SELECT  "api_users".* FROM "api_users" WHERE "api_users"."id" = $1 LIMIT 1  [["id", 29]]
UPDATE "api_users" SET "image_updated_at" = $1, "image_file_name" = $2, "updated_at" = $3 WHERE "api_users"."id" = $4  [["image_updated_at", "2016-09-13 16:15:41.976956"], ["image_file_name", "d1lmKc9_-1.jpg"], ["updated_at", "2016-09-13 16:15:42.008384"], ["id", 29]]

  def index
    @users = Api::User.includes(:projects).all
---
SELECT "api_users".* FROM "api_users"

  def show
    @user = Api::User.find(params[:id])
---
SELECT  "api_users".* FROM "api_users" WHERE "api_users"."id" = $1 LIMIT 1  [["id", 2]]