app/views/api/projects/show.json.jbuilder

  @project.fundings.each do |funding|
    amount_array << Api::Reward.find(funding.reward_id).amount
---
SELECT "api_rewards".* FROM "api_rewards" INNER JOIN "api_saved_projects" ON "api_rewards"."project_id" = "api_saved_projects"."id" WHERE "api_saved_projects"."id" = $1  [["id", 164]]